Material/ReadingGuide.tex
% Created 2016-04-15 Fri 10:59
\documentclass[10pt,t,a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mikael Svahnberg\thanks{Mikael.Svahnberg@bth.se}}
\date{2016-04-04}
\title{Reading Guide \texttt{PA14[13]5}}
\hypersetup{
 pdfauthor={Mikael Svahnberg},
 pdftitle={Reading Guide \texttt{PA14[13]5}},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.50.1 (Org mode 8.3.4)}, 
 pdflang={English}}
\begin{document}

\maketitle


\section{Lecture 01 Introduction}
\label{sec:orgheadline3}
\subsection{Read (in Larman, chapters):}
\label{sec:orgheadline1}
\begin{enumerate}
\item Object-Oriented Analysis and Design
\item Iteraative, Evolutionary, and Agile
\item Case Studies (we will be using the POST case study)
\end{enumerate}

\subsection{Watch:}
\label{sec:orgheadline2}
\begin{itemize}
\item none.
\end{itemize}
\section{Lecture 02 Development Methods}
\label{sec:orgheadline6}
\subsection{Read:}
\label{sec:orgheadline4}
\begin{enumerate}
\setcounter{enumi}{20}
\item Test-Driven Development and Refactoring
\setcounter{enumi}{39}
\item More on Iterative Development and Agile Project Management
\end{enumerate}

\subsection{Watch:}
\label{sec:orgheadline5}
\begin{itemize}
\item \href{https://play.bth.se/media/Development+Process/1_gmy3m68z/41750261}{Development Process}
\end{itemize}
\section{Lecture 03 Requirements}
\label{sec:orgheadline9}
\subsection{Read:}
\label{sec:orgheadline7}
\begin{enumerate}
\setcounter{enumi}{3}
\item Inception is Not the Requirements Phase
\item Evolutionary Requirements
\item Use Cases
\item Other Requirements
\end{enumerate}

\subsection{Watch:}
\label{sec:orgheadline8}
\begin{itemize}
\item \href{https://play.bth.se/media/Requirements+Engineering/1_epma2li8/41750261}{Requirements Engineering}
\item \href{https://play.bth.se/media/Use+Cases/1_d4tqygel/41750261}{Use Cases}
\end{itemize}
\section{Lecture 04 Modelling Structure}
\label{sec:orgheadline12}
\subsection{Read:}
\label{sec:orgheadline10}
\begin{enumerate}
\setcounter{enumi}{7}
\item Iteration 1 -- Basics
\item Domain Models
\end{enumerate}

\subsection{Watch}
\label{sec:orgheadline11}
\begin{itemize}
\item \href{https://play.bth.se/media/Concept+and+Classes/1_m237spjq/41750261}{Concepts and Classes}
\end{itemize}
\section{Lecture 05 Modelling Behaviour}
\label{sec:orgheadline15}
\subsection{Read:}
\label{sec:orgheadline13}
\begin{enumerate}
\setcounter{enumi}{9}
\item System Sequence Diagrams
\item Operation Contracts
\setcounter{enumi}{12}
\item Logical Architecture and UML Package Diagrams
\setcounter{enumi}{28}
\item UML State Machine Diagrams
\item Relating Use Cases
\end{enumerate}

\subsection{Watch:}
\label{sec:orgheadline14}
\begin{itemize}
\item \href{https://play.bth.se/media/Structuring+Use+Cases/1_seaeffad/41750261}{Structuring Use Cases}
\item \href{https://play.bth.se/media/SystemSequenceDiagrams.mp4/1_99i0cfv7/41750261}{System Sequence Diagrams}
\item \href{https://play.bth.se/media/Contracts/1_086yu2lr/41750261}{Contracts}
\item \href{https://play.bth.se/media/StateDiagrams.mp4/1_ruht53d3}{State Diagrams}
\end{itemize}
\section{Modelling Design -- Collaborations}
\label{sec:orgheadline18}
\textbf{Note:} This used to be a separate lecture that I have now merged into lecture 04 and 05. I am keeping this as a placeholder so you don't get upset that I suddenly add new chapters that you ``should have read'' before a lecture that you have already attended.
\subsection{Read:}
\label{sec:orgheadline16}
\begin{enumerate}
\setcounter{enumi}{14}
\item UML Interaction Diagrams
\item UML Class Diagrams
\setcounter{enumi}{30}
\item Domain Model Refinement
\item More SSD and Contracts
\end{enumerate}

\subsection{Watch:}
\label{sec:orgheadline17}
\begin{itemize}
\item TBD
\end{itemize}
\section{Lecture 06 Design Patterns}
\label{sec:orgheadline21}
\subsection{Read:}
\label{sec:orgheadline19}
\begin{enumerate}
\setcounter{enumi}{16}
\item GRASP: Designing Objects with Responsibilities
\item Object Design Examples with GRASP
\setcounter{enumi}{24}
\item GRASP More Objects with Responsibilities
\item Applying GoF Design Patterns
\setcounter{enumi}{35}
\item More Object Design with GoF Patterns
\end{enumerate}

\subsection{Watch:}
\label{sec:orgheadline20}
\begin{itemize}
\item \href{https://play.bth.se/media/DesignPatterns_GRASP/1_e4z8gitx}{GRASP Patterns}
\item \href{https://play.bth.se/media/DesignPatterns_GoF/1_xdlww0y6}{GoF Design Patterns}
\end{itemize}
\section{Lecture 07 Mapping Design to Code}
\label{sec:orgheadline24}
\subsection{Read:}
\label{sec:orgheadline22}
\begin{enumerate}
\setcounter{enumi}{18}
\item Designing for Visibility
\item Mapping Design to Code
\end{enumerate}

\subsection{Watch:}
\label{sec:orgheadline23}
\begin{itemize}
\item TBD
\end{itemize}
\end{document}